package config

import (
	"capstone-project/entity"
	"fmt"
	"time"
)

func SetupDiaryDatabase() {
	db.AutoMigrate(
		&entity.Diaries{},
	)

	diary := entity.Diaries{
		Title: "วันที่รู้สึกไม่เก่งพอ",
		Content: `วันนี้ฉันตื่นขึ้นมาพร้อมกับความรู้สึกหนักอึ้งในอก เหมือนมีบางอย่างกดทับฉันไว้ตั้งแต่ยังไม่ลืมตาดี ฉันมีประชุมกับหัวหน้าช่วงบ่าย แต่แค่คิดถึงมัน ใจฉันก็เต้นแรงขึ้นมาโดยไม่มีเหตุผล ฉันรู้สึกว่าฉันจะทำพังอีกครั้ง รู้สึกเหมือนฉันไม่ดีพอ ไม่เก่งพอ ไม่คู่ควรกับตำแหน่งที่ทำอยู่
					ฉันนั่งนิ่งอยู่พักหนึ่ง ก่อนจะเริ่มจดสิ่งที่ต้องพูดไว้ในสมุด พยายามเตรียมตัวให้พร้อมที่สุด ถึงแม้ว่าความคิดในหัวจะยังคอยตอกย้ำว่า “ยังไงก็พังอยู่ดี” แต่ฉันก็พยายามเงียบเสียงนั้นไว้ให้ได้มากที่สุด
					พอถึงเวลาจริง การประชุมไม่ได้แย่อย่างที่คิด ฉันพูดได้ค่อนข้างราบรื่น หัวหน้าก็ไม่ได้ดูโกรธอะไรเลย กลับชมเรื่องที่ฉันเตรียมข้อมูลมาดีเสียอีก หลังจากจบประชุม ฉันรู้สึกเบาใจขึ้นมานิดหน่อย เหมือนผ่านอะไรบางอย่างมาได้ แม้มันจะยังไม่หายดี แต่ฉันก็เริ่มเห็นว่า ความคิดในหัวบางทีก็ไม่ใช่ความจริงเสมอไป
					บางทีฉันอาจจะไม่ต้อง “เก่งที่สุด” ก็ได้ แค่ “เพียงพอ” ก็อาจจะดีแล้วก็ได้เหมือนกัน`,
		UpdatedAt: time.Now(),
		TherapyCaseID: 1,
	}

	// Optional: Save to database if needed
	db.FirstOrCreate(&diary)

	fmt.Println("Diary data has been added to the database.")
}
